#Использовать asserts
#Использовать "utils"

#Область ОбработчикиТестов

&Тест
Процедура Тест_ПулыПриложений() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);

	// Когда
	ПулыПриложений = МенеджерСервера.ПулыПриложений;

	// Тогда
	Ожидаем.Что(ПулыПриложений).ИмеетТип("КоллекцияПуловПриложенийIIS");

КонецПроцедуры

&Тест
Процедура Тест_Сайты() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);

	// Когда
	Сайты = МенеджерСервера.Сайты;

	// Тогда
	Ожидаем.Что(Сайты).ИмеетТип("КоллекцияСайтовIIS");

КонецПроцедуры

#КонецОбласти
