#Использовать asserts
#Использовать "utils"

#Область ОбработчикиТестов

&Тест
Процедура Тест_Свойства() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Сайт = МенеджерСервера.Сайты.Первый();

	// Когда
	Приложение = Сайт.Приложения["/infobase"];

	// Тогда
	Ожидаем.Что(Приложение.Путь).Равно("/infobase");
	Ожидаем.Что(Приложение.ФизическийПуть).Равно("%SystemDrive%\inetpub\wwwroot\infobase");
	Ожидаем.Что(Приложение.ИмяПулаПриложений).Равно("EnterpriseAppPool");

КонецПроцедуры

&Тест
Процедура Тест_ИмяПулаПриложений() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Сайт = МенеджерСервера.Сайты.Первый();
	Приложение = Сайт.Приложения["/infobase"];
	ИмяПулаПриложений = "DefaultAppPool";

	// Когда
	Приложение.ИмяПулаПриложений = ИмяПулаПриложений;

	// Тогда
	Ожидаем.Что(Приложение.ИмяПулаПриложений).Равно(ИмяПулаПриложений);

КонецПроцедуры

#КонецОбласти
