#Использовать asserts
#Использовать "utils"

#Область ОбработчикиТестов

&Тест
Процедура Тест_Количество() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Сайт = МенеджерСервера.Сайты.Первый();
	Приложения = Сайт.Приложения;

	// Когда
	Количество = Приложения.Количество();

	// Тогда
	Ожидаем.Что(Количество).Равно(2);

КонецПроцедуры

&Тест
Процедура Тест_Добавить() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Сайт = МенеджерСервера.Сайты.Первый();
	Приложения = Сайт.Приложения;
	ПутьПриложения = "/testApplication";
	ФизическийПутьПриложения = "%SystemDrive%\inetpub\wwwroot\testApplication";

	// Когда
	Приложение = Приложения.Добавить(ПутьПриложения, ФизическийПутьПриложения);

	// Тогда
	Ожидаем.Что(Приложения.Количество()).Равно(3);
	Ожидаем.Что(Приложение).ИмеетТип("ПриложениеIIS");
	Ожидаем.Что(Приложение.Путь).Равно(ПутьПриложения);
	Ожидаем.Что(Приложение.ФизическийПуть).Равно(ФизическийПутьПриложения);

КонецПроцедуры

&Тест
Процедура Тест_Получить() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Сайт = МенеджерСервера.Сайты.Первый();
	Приложения = Сайт.Приложения;
	ПутьПриложения = "/infobase";

	// Когда
	Приложение = Приложения.Получить(ПутьПриложения);

	// Тогда
	Ожидаем.Что(Приложение).ИмеетТип("ПриложениеIIS");
	Ожидаем.Что(Приложение.Путь).Равно(ПутьПриложения);

КонецПроцедуры

#КонецОбласти
