#Использовать asserts
#Использовать "utils"

#Область ОбработчикиТестов

&Тест
Процедура Тест_Количество() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	ПулыПриложений = МенеджерСервера.ПулыПриложений;

	// Когда
	Количество = ПулыПриложений.Количество();

	// Тогда
	Ожидаем.Что(Количество).Равно(2);

КонецПроцедуры

&Тест
Процедура Тест_Получить() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	ПулыПриложений = МенеджерСервера.ПулыПриложений;
	ИмяПулаПриложений = "EnterpriseAppPool";

	// Когда
	ПулПриложений = ПулыПриложений.Получить("EnterpriseAppPool");

	// Тогда
	Ожидаем.Что(ПулПриложений).ИмеетТип("ПулПриложенийIIS");
	Ожидаем.Что(ПулПриложений.Имя).Равно(ИмяПулаПриложений);

КонецПроцедуры


&Тест
Процедура Тест_Добавить() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	ПулыПриложений = МенеджерСервера.ПулыПриложений;
	ИмяПулаПриложений = "TestApplicationPool";

	// Когда
	ПулПриложений = ПулыПриложений.Добавить(ИмяПулаПриложений);

	// Тогда
	Ожидаем.Что(ПулПриложений).ИмеетТип("ПулПриложенийIIS");
	Ожидаем.Что(ПулПриложений.Имя).Равно(ИмяПулаПриложений);
	Ожидаем.Что(ПулыПриложений.Количество()).Равно(3);

КонецПроцедуры

&Тест
Процедура Тест_Удалить() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	ПулыПриложений = МенеджерСервера.ПулыПриложений;
	ПулПриложений = ПулыПриложений["EnterpriseAppPool"];

	// Когда
	ПулыПриложений.Удалить(ПулПриложений);

	// Тогда
	Ожидаем.Что(ПулыПриложений.Количество()).Равно(1);

КонецПроцедуры

#КонецОбласти
