#Использовать asserts
#Использовать "utils"

#Область ОбработчикиТестов

&Тест
Процедура Тест_Количество() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Ограничения = МенеджерСервера.ОграниченияISAPI;
	
	// Когда
	Количество = Ограничения.Количество();

	// Тогда
	Ожидаем.Что(Количество).Равно(2);

КонецПроцедуры

&Тест
Процедура Тест_Получить() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Ограничения = МенеджерСервера.ОграниченияISAPI;
	ПутьОграничения = "%ProgramFiles%\1cv8\8.3.18.1779\bin\wsisapi.dll";

	// Когда
	Ограничение = Ограничения.Получить(ПутьОграничения);

	// Тогда
	Ожидаем.Что(Ограничение).ИмеетТип("ОграничениеISAPI");
	Ожидаем.Что(Ограничение.Путь).Равно(ПутьОграничения);

КонецПроцедуры

&Тест
Процедура Тест_СоздатьЭлемент() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Ограничения = МенеджерСервера.ОграниченияISAPI;
	ПутьОграничения = "%ProgramFiles%\1cv8\8.3.20.1789\bin\wsisapi.dll";
	
	// Когда
	Ограничение = Ограничения.СоздатьЭлемент(ПутьОграничения);

	// Тогда
	Ожидаем.Что(Ограничение).ИмеетТип("ОграничениеISAPI");
	Ожидаем.Что(Ограничение.Путь).Равно(ПутьОграничения);

КонецПроцедуры

&Тест
Процедура Тест_Добавить() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Ограничения = МенеджерСервера.ОграниченияISAPI;
	ПутьОграничения = "%ProgramFiles%\1cv8\8.3.20.1789\bin\wsisapi.dll";
	Ограничение = Ограничения.СоздатьЭлемент(ПутьОграничения);

	// Когда
	Ограничения.Добавить(Ограничение);

	// Тогда
	Ожидаем.Что(Ограничения.Количество()).Равно(3);

КонецПроцедуры

&Тест
Процедура Тест_Удалить() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Ограничения = МенеджерСервера.ОграниченияISAPI;
	Ограничение = Ограничения["%ProgramFiles%\1cv8\8.3.18.1779\bin\wsisapi.dll"];

	// Когда
	Ограничения.Удалить(Ограничение);

	// Тогда
	Ожидаем.Что(Ограничения.Количество()).Равно(1);

КонецПроцедуры

&Тест
Процедура Тест_Очистить() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Ограничения = МенеджерСервера.ОграниченияISAPI;

	// Когда
	Ограничения.Очистить();

	// Тогда
	Ожидаем.Что(Ограничения.Количество()).Равно(0);

КонецПроцедуры

#КонецОбласти
