#Использовать asserts
#Использовать "utils"

#Область ОбработчикиТестов

&Тест
Процедура Тест_Свойства() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Ограничения = МенеджерСервера.ОграниченияISAPI;
	ПутьОграничения = "%ProgramFiles%\1cv8\8.3.18.1779\bin\wsisapi.dll";
	
	// Когда
	Ограничение = Ограничения[ПутьОграничения];

	// Тогда
	Ожидаем.Что(Ограничение.Путь).Равно(ПутьОграничения);
	Ожидаем.Что(Ограничение.Разрешено).Равно(Истина);
	Ожидаем.Что(Ограничение.Описание).Равно("1C:Enterprise 8. wsisapi component");

КонецПроцедуры

&Тест
Процедура Тест_УстановкаРазрешено() Экспорт
 	
	// Дано
	КонфигурацияХоста = ПомощникТестирования.КонфигурацияХоста();
	МенеджерСервера = Новый МенеджерСервераIIS(КонфигурацияХоста);
	Ограничения = МенеджерСервера.ОграниченияISAPI;
	Ограничение = Ограничения["%ProgramFiles%\1cv8\8.3.18.1779\bin\wsisapi.dll"];
	
	// Когда
	Ограничение.Разрешено = Ложь;

	// Тогда
	Ожидаем.Что(Ограничение.Разрешено).ЭтоЛожь();

КонецПроцедуры

#КонецОбласти
